soap/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getProductSoapRequest>
         <gs:title>пряник</gs:title>
      </gs:getProductSoapRequest>
   </soapenv:Body>
</soapenv:Envelope>
